package com.football;
//Необходимо реализовать в рамках объектно-ориентированной
//парадигмы на языке Java предложенные варианты заданий.
//Реализовать иерархию минимум из 3 классов. Каждый класс должен
//иметь в своем составе минимум 5 полей и 3 метода.
//Выполнить анализ предметной области. Спроектировать и реализовать
//структуру классов предметной области. Разработать программу,
//демонстрирующую использование всех возможностей полученной иерархии
//классов



//Футбольные команды
//– определить команду с самым большим количеством побед;
//– определить команды с количеством побед больше среднего;
//– упорядочить массив по убыванию мест в лиге;
//– организовать поиск по названию команды, исправление одного из
//полей и вывод полной информации о команде после редактирования.
public class Main {
    public static void main(String[] args) {

    }
}
